Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/edc/PIC32MK1024GPL064.PIC
      <edc:SFRDef edc:_addr="0x1F82C070" edc:_begin="0x10" edc:_end="0x30" edc:_modsrc="DOS-03554_cmp_control_upb_v2_32bit.Module" edc:_refcount="4" edc:access="---n--nn-nnnnnnnnnnn--nrnn-n--nn" edc:cname="CM4CON" edc:desc="" edc:impl="0x137ff3d3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---u--00-00000000000--0000-0--00" edc:name="CM4CON" edc:nzwidth="32" edc:por="---x--00-00000000000--0000-0--00" edc:portals="CLR SET INV" ltx:baseofperipheral="CMP4">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CCH" edc:desc="" edc:mask="0x3" edc:name="CCH" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CREF" edc:desc="" edc:mask="0x1" edc:name="CREF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EVPOL" edc:desc="" edc:mask="0x3" edc:name="EVPOL" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="COUT" edc:desc="" edc:mask="0x1" edc:name="COUT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CEVT" edc:desc="" edc:mask="0x1" edc:name="CEVT" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="OPLPWR" edc:desc="" edc:mask="0x1" edc:name="OPLPWR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CPOL" edc:desc="" edc:mask="0x1" edc:name="CPOL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="COE" edc:desc="" edc:mask="0x1" edc:name="COE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CFDIV" edc:desc="" edc:mask="0x7" edc:name="CFDIV" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="CFLTREN" edc:desc="" edc:mask="0x1" edc:name="CFLTREN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CFSEL" edc:desc="" edc:mask="0x7" edc:name="CFSEL" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="HYSSEL" edc:desc="" edc:mask="0x3" edc:name="HYSSEL" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="HYSPOL" edc:desc="Comparator Hysteresis Polarity Selection" edc:mask="0x1" edc:name="HYSPOL" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Hysteresis on falling edge, rising edge is accurate" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Hysteresis on rising edge, falling edge is accurate" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82C080" edc:_begin="0x10" edc:_end="0x30" edc:_modsrc="DOS-03554_cmp_control_upb_v2_32bit.Module" edc:_refcount="4" edc:access="----nnnnnnnnnnnnn-nnnnnnnnnnnnnn" edc:cname="CM4MSKCON" edc:desc="" edc:impl="0xfffbfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000000000000-00000000000000" edc:name="CM4MSKCON" edc:nzwidth="32" edc:por="----0000000000000-00000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CMP4">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AANEN" edc:desc="" edc:mask="0x1" edc:name="AANEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AAEN" edc:desc="" edc:mask="0x1" edc:name="AAEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ABNEN" edc:desc="" edc:mask="0x1" edc:name="ABNEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ABEN" edc:desc="" edc:mask="0x1" edc:name="ABEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACNEN" edc:desc="" edc:mask="0x1" edc:name="ACNEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACEN" edc:desc="" edc:mask="0x1" edc:name="ACEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PAGS" edc:desc="" edc:mask="0x1" edc:name="PAGS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="NAGS" edc:desc="" edc:mask="0x1" edc:name="NAGS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OANEN" edc:desc="" edc:mask="0x1" edc:name="OANEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OAEN" edc:desc="" edc:mask="0x1" edc:name="OAEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OBNEN" edc:desc="" edc:mask="0x1" edc:name="OBNEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OBEN" edc:desc="" edc:mask="0x1" edc:name="OBEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OCNEN" edc:desc="" edc:mask="0x1" edc:name="OCNEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OCEN" edc:desc="" edc:mask="0x1" edc:name="OCEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="HLMS" edc:desc="" edc:mask="0x1" edc:name="HLMS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SELSRCA" edc:desc="" edc:mask="0xf" edc:name="SELSRCA" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="SELSRCB" edc:desc="" edc:mask="0xf" edc:name="SELSRCB" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="SELSRCC" edc:desc="" edc:mask="0xf" edc:name="SELSRCC" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82C090" edc:_begin="0x10" edc:_end="0x30" edc:_modsrc="DOS-03554_cmp_control_upb_v2_32bit.Module" edc:_refcount="5" edc:access="nn-n--nn-nnnnnnnnnnn--nrnn-n--nn" edc:cname="CM5CON" edc:desc="" edc:impl="0xd37ff3d3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu-u--00-00000000000--0000-0--00" edc:name="CM5CON" edc:nzwidth="32" edc:por="xx-x--00-00000000000--0000-0--00" edc:portals="CLR SET INV" ltx:baseofperipheral="CMP5">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CCH" edc:desc="" edc:mask="0x3" edc:name="CCH" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CREF" edc:desc="" edc:mask="0x1" edc:name="CREF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EVPOL" edc:desc="" edc:mask="0x3" edc:name="EVPOL" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="COUT" edc:desc="" edc:mask="0x1" edc:name="COUT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CEVT" edc:desc="" edc:mask="0x1" edc:name="CEVT" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="OPLPWR" edc:desc="" edc:mask="0x1" edc:name="OPLPWR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CPOL" edc:desc="" edc:mask="0x1" edc:name="CPOL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="COE" edc:desc="" edc:mask="0x1" edc:name="COE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CFDIV" edc:desc="" edc:mask="0x7" edc:name="CFDIV" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="CFLTREN" edc:desc="" edc:mask="0x1" edc:name="CFLTREN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CFSEL" edc:desc="" edc:mask="0x7" edc:name="CFSEL" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="HYSSEL" edc:desc="" edc:mask="0x3" edc:name="HYSSEL" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="HYSPOL" edc:desc="Comparator Hysteresis Polarity Selection" edc:mask="0x1" edc:name="HYSPOL" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Hysteresis on falling edge, rising edge is accurate" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Hysteresis on rising edge, falling edge is accurate" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENPGA" edc:desc="Opamp Fixed Gain Enable bit" edc:mask="0x1" edc:name="ENPGA" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Op amp is operating in Fixed Gain 1X mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Op amp is operating in Open Loop Mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OPAON" edc:desc="Opamp Enable Bit" edc:mask="0x1" edc:name="OPAON" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Opamp Enabled and Connected to Pin" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Opamp is disabled and pin is released to other functions" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82C0A0" edc:_begin="0x10" edc:_end="0x30" edc:_modsrc="DOS-03554_cmp_control_upb_v2_32bit.Module" edc:_refcount="5" edc:access="----nnnnnnnnnnnnn-nnnnnnnnnnnnnn" edc:cname="CM5MSKCON" edc:desc="" edc:impl="0xfffbfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000000000000-00000000000000" edc:name="CM5MSKCON" edc:nzwidth="32" edc:por="----0000000000000-00000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CMP5">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AANEN" edc:desc="" edc:mask="0x1" edc:name="AANEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AAEN" edc:desc="" edc:mask="0x1" edc:name="AAEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ABNEN" edc:desc="" edc:mask="0x1" edc:name="ABNEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ABEN" edc:desc="" edc:mask="0x1" edc:name="ABEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACNEN" edc:desc="" edc:mask="0x1" edc:name="ACNEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACEN" edc:desc="" edc:mask="0x1" edc:name="ACEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PAGS" edc:desc="" edc:mask="0x1" edc:name="PAGS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="NAGS" edc:desc="" edc:mask="0x1" edc:name="NAGS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OANEN" edc:desc="" edc:mask="0x1" edc:name="OANEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OAEN" edc:desc="" edc:mask="0x1" edc:name="OAEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OBNEN" edc:desc="" edc:mask="0x1" edc:name="OBNEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OBEN" edc:desc="" edc:mask="0x1" edc:name="OBEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OCNEN" edc:desc="" edc:mask="0x1" edc:name="OCNEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OCEN" edc:desc="" edc:mask="0x1" edc:name="OCEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="HLMS" edc:desc="" edc:mask="0x1" edc:name="HLMS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SELSRCA" edc:desc="" edc:mask="0xf" edc:name="SELSRCA" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="SELSRCB" edc:desc="" edc:mask="0xf" edc:name="SELSRCB" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="SELSRCC" edc:desc="" edc:mask="0xf" edc:name="SELSRCC" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F82C0B0" edc:offset="0x150"/>
      <edc:SFRDef edc:_addr="0x1F82C200" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-01445_dac_nbit__control_upb_v1_32bit.Module" edc:_refcount="1" edc:access="----nnnnnnnnnnnnn------n------nn" edc:cname="DAC1CON" edc:desc="CDAC Control Register" edc:impl="0xfff8103" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000000000000------0------00" edc:name="DAC1CON" edc:nzwidth="32" edc:por="----0000000000000------0------00" edc:portals="CLR SET INV" ltx:baseofperipheral="CDAC1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="REFSEL" edc:desc="Reference Source Select" edc:mask="0x3" edc:name="REFSEL" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="No Reference Selected (no current consumed)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:desc="Positive Reference Voltage = External Vref+ Pin" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Positive Reference Voltage = 2 * Internal Bandgap Reference Voltage" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Positive Reference Voltage = AVdd" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DACOE" edc:desc="CDAC Output Enable" edc:mask="0x1" edc:name="DACOE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Output is Disabled; drive to pin is floating" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:desc="Output is Enabled; CDAC voltage is connected to the pin." edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="CDAC Enable" edc:mask="0x1" edc:name="ON" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="The CDAC is Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:desc="The CDAC is Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DACDAT" edc:desc="Data Input Register Bits for the CDAC" edc:mask="0xfff" edc:name="DACDAT" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F82C210" edc:offset="0xDF0"/>
      <edc:SFRDef edc:_addr="0x1F82D000" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-01461_afe_ctmu_con_upb_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnn--nnnnnnnnnnnnnnnn" edc:cname="CTMUCON" edc:desc="" edc:grp="CTMU" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000--0000000000000000" edc:name="CTMUCON" edc:nzwidth="0x20" edc:por="00000000000000--0000000000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="CTMU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IRNG" edc:desc="" edc:mask="0x3" edc:name="IRNG" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ITRIM" edc:desc="" edc:mask="0x3f" edc:name="ITRIM" edc:nzwidth="6"/>
            <edc:SFRFieldDef edc:cname="CTTRIG" edc:desc="" edc:mask="0x1" edc:name="CTTRIG" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IDISSEN" edc:desc="" edc:mask="0x1" edc:name="IDISSEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EDGSEQEN" edc:desc="" edc:mask="0x1" edc:name="EDGSEQEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EDGEN" edc:desc="" edc:mask="0x1" edc:name="EDGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TGEN" edc:desc="" edc:mask="0x1" edc:name="TGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CTMUSIDL" edc:desc="" edc:mask="0x1" edc:name="CTMUSIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="EDG2SEL" edc:desc="" edc:mask="0xf" edc:name="EDG2SEL" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="EDG2POL" edc:desc="" edc:mask="0x1" edc:name="EDG2POL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EDG2MOD" edc:desc="" edc:mask="0x1" edc:name="EDG2MOD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EDG1STAT" edc:desc="" edc:mask="0x1" edc:name="EDG1STAT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EDG2STAT" edc:desc="" edc:mask="0x1" edc:name="EDG2STAT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EDG1SEL" edc:desc="" edc:mask="0xf" edc:name="EDG1SEL" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="EDG1POL" edc:desc="" edc:mask="0x1" edc:name="EDG1POL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EDG1MOD" edc:desc="" edc:mask="0x1" edc:name="EDG1MOD" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CTMU" edc:pos="14"/>
      </edc:SFRDef>
